app/views/equipments/edit.html.erb

SELECT `brands`.* FROM `brands`
---
        <label>Marca</label>
        <%= f.collection_select(:brand_id, Brand.all, :id, :name, {:include_blank => "Selecione uma Marca"}, {class: "form-control"}) %>