app/views/equipments/index.html.erb

SELECT  1 AS one FROM `brands` WHERE `brands`.`id` IS NULL LIMIT 1
SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 3 LIMIT 1
---
                  <td class="col-md-4">
                    <%= Brand.find(equipment.brand_id).name if Brand.exists? id: equipment.brand_id %>