app/views/equipments/new.html.erb

SELECT `brands`.* FROM `brands` ORDER BY `brands`.`name` ASC
---
        <label>Marca</label>
        <%= f.collection_select(:brand_id, Brand.all, :id, :name, {:include_blank => "Selecione uma Marca"}, {class: "form-control"}) %>