app/views/orders/edit.html.erb

            <br>
            <%= Equipment.find(@order.equipment_id).specs %>
---
SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1