app/views/orders/edit.html.erb

SELECT `customers`.* FROM `customers`
---
        <label>Cliente*</label>
        <%= f.collection_select(:customer_id, Customer.all, :id, :full_name, {:include_blank => "Selecione um Cliente"}) %>

SELECT `equipment`.* FROM `equipment`
---
        <label>Equipamento*</label>
        <%= f.collection_select(:equipment_id, Equipment.all, :id, :specs, {:include_blank => "Selecione um Equipamento"}) %>