app/views/orders/index.html.erb

                  <td class="col-md-3">
                    <%= Customer.find(order.customer_id).full_name if Customer.exists? id: order.customer_id %>
---
SELECT  1 AS one FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

                  <td class="col-md-6">
                    <%= Equipment.find(order.equipment_id).specs if Equipment.exists? id: order.equipment_id %>
---
SELECT  1 AS one FROM `equipment` WHERE `equipment`.`id` = 3 LIMIT 1
SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 3 LIMIT 1

                  <td class="col-md-1 text-center">
                    <%= I18n.t(Order.find(order.id).status) %>
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1