app/views/orders/new.html.erb

        <label>Cliente*</label>
        <%= f.collection_select(:customer_id, Customer.all, :id, :full_name, {:include_blank => "Selecione um Cliente"}, {class: "form-control"}) %>
---
SELECT `customers`.* FROM `customers`

        <label>Equipamento*</label>
        <%= f.collection_select(:equipment_id, Equipment.all, :id, :specs, {:include_blank => "Selecione um Equipamento"}, {class: "form-control"}) %>
---
SELECT `equipment`.* FROM `equipment`