app/controllers/brands_controller.rb

SELECT `brands`.* FROM `brands` ORDER BY `brands`.`name` ASC
---
	def index
		@brands = Brand.order :name

INSERT INTO `brands` (`name`, `created_at`, `updated_at`) VALUES ('dasdsa', '2016-09-21 20:07:46', '2016-09-21 20:07:46')
---
	def create
    @brand = Brand.new(brand_params)
    if @brand.save

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 16 LIMIT 1
---
  def edit
    @brand = Brand.find(params[:id])

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 1 LIMIT 1
UPDATE `brands` SET `name` = 'eitaaaaaa', `updated_at` = '2016-09-29 21:17:41' WHERE `brands`.`id` = 1
---
	def update
		@brand = Brand.find(params[:id])
    if @brand.update(brand_params)

SELECT  `brands`.* FROM `brands` WHERE `brands`.`id` = 6 LIMIT 1
DELETE FROM `brands` WHERE `brands`.`id` = 6
---
	def destroy
		@brand = Brand.find params[:id]
	  @brand.destroy