app/controllers/customers_controller.rb

	def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO `customers` (`first_name`, `last_name`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('tiozao', 'dasdsad', 'dsadsa', '312321', '2016-10-05 21:37:20', '2016-10-05 21:37:20')

  def edit
    @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 3 LIMIT 1

	def update
		@customer = Customer.find(params[:id])
		if @customer.update(customer_params)
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 3 LIMIT 1
UPDATE `customers` SET `first_name` = 'Mariaaaa', `updated_at` = '2016-10-04 20:48:15' WHERE `customers`.`id` = 3

	def destroy
		@customer = Customer.find params[:id]
		@customer.destroy
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1
DELETE FROM `customers` WHERE `customers`.`id` = 2