app/controllers/equipments_controller.rb

SELECT `equipment`.* FROM `equipment` ORDER BY `equipment`.`created_at` ASC
---
	def index
		@all_equipment = Equipment.order :created_at

INSERT INTO `equipment` (`name`, `model`, `description`, `created_at`, `updated_at`, `brand_id`) VALUES ('Teste', 'gudyasg', 'dgysauyg', '2016-09-26 23:52:03', '2016-09-26 23:52:03', 1)
---
	def create
    @equipment = Equipment.new(equipment_params)
    if @equipment.save

SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1
---
  def edit
    @equipment = Equipment.find(params[:id])

SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1
UPDATE `equipment` SET `name` = 'Impressora DeskJetdsadsadsa', `updated_at` = '2016-10-04 17:12:49' WHERE `equipment`.`id` = 1
---
	def update
		@equipment = Equipment.find(params[:id])
		if @equipment.update(equipment_params)

SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1
DELETE FROM `equipment` WHERE `equipment`.`id` = 1
---
	def destroy
		@equipment = Equipment.find params[:id]
		@equipment.destroy