app/controllers/orders_controller.rb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
  def index
    if params[:date]
      date = JSON.parse(params[:date])
      @orders = current_user.orders.where(created_at: date["start"]..date["end"]).order :created_at
    else
      @orders = current_user.orders.order :created_at

INSERT INTO `orders` (`defect`, `serial_number`, `observation`, `created_at`, `updated_at`, `equipment_id`, `customer_id`) VALUES ('Nao imprime', '', '', '2016-10-05 22:48:12', '2016-10-05 22:48:12', 1, 1)
---
	def create
    @order = Order.new(order_params)
    @order.status = :opened
    @order.user = current_user
    if @order.save

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1
---
  def edit
    order = Order.find(params[:id])

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
	def update
		@order = Order.find(params[:id])

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 2
---
	def destroy
		@order = Order.find params[:id]
		@order.destroy